# Statistics Practice 1

Here are a few statistical analysis tasks..

#### Importing Libraries

In [1]:
# general
import numpy as np
import pandas as pd
pd.plotting.register_matplotlib_converters()

# mpl
import matplotlib as mpl
import matplotlib.pyplot as plt

# plotly
import plotly.express as px
import plotly.io as pio
import plotly.figure_factory as ff
pio.renderers.default = 'iframe'

# stats
from scipy import stats
#from lmfit.models import GaussianModel

### 1) Random Dataset

In [2]:
# creating a random categorical dataframe
# car makes and colour

# config
n_rows = int(5e4)

columns = ['Toyota'
           ,'Honda'
           ,'Chevrolet'
           ,'Ford'
           ,'Mercedes'
           ,'Jeep'
           ,'BMW'
           ,'Porsche'
          ]
n_cols = len(columns)
           
cat_vars = ['red','green','blue']
# --------------------------------

car_data = pd.DataFrame(np.random.choice(cat_vars,size=(n_rows,n_cols))
                       ,columns=columns)

car_data.head()

  Toyota  Honda Chevrolet   Ford Mercedes   Jeep    BMW Porsche
0    red  green      blue   blue    green    red  green    blue
1    red  green      blue   blue      red   blue  green   green
2  green   blue     green   blue    green  green  green     red
3    red   blue      blue  green     blue  green    red     red
4   blue  green      blue    red     blue   blue  green    blue

In [3]:
car_data.describe()

       Toyota  Honda Chevrolet   Ford Mercedes   Jeep    BMW Porsche
count   50000  50000     50000  50000    50000  50000  50000   50000
unique      3      3         3      3        3      3      3       3
top     green  green     green   blue    green  green   blue    blue
freq    16801  16755     16706  16801    16763  16727  16835   16928

#### How many unique rows are possible?

In [4]:
n_unique = len(cat_vars)**n_cols
all_to_unq = n_rows/ n_unique
print("""
      N variables:   {}
      N columns:     {}
      N unique rows: {}
      all/unique :   {:2.1f}
      """.format(len(cat_vars),n_cols,n_unique,all_to_unq))

      N variables:   3
      N columns:     8
      N unique rows: 6561
      all/unique :   7.6

### How many rows have the same combination?
Looking at number of rows with each unique combination -- i.e. **group sizes**

E.g. 21 --> means that 21 rows have this unique combination

In [5]:
unq_rows = car_data.value_counts()
unq_rows

Toyota  Honda  Chevrolet  Ford   Mercedes  Jeep   BMW    Porsche
blue    green  red        green  blue      blue   blue   red        19
green   red    blue       blue   green     green  red    red        19
blue    green  green      blue   blue      blue   green  red        19
red     blue   red        red    blue      blue   blue   blue       18
               green      blue   blue      red    red    red        18
                                                                    ..
blue    blue   red        green  blue      green  green  blue        1
green   blue   green      red    green     blue   red    blue        1
blue    red    red        red    blue      blue   red    red         1
        blue   green      green  green     green  red    blue        1
               red        blue   blue      green  green  red         1
Length: 6557, dtype: int64

### What is frequency of each "group size"?
E.g. how many occurences do we have, where 21 rows have the same combination?

In [6]:
row_fq = unq_rows.value_counts().rename_axis(index='group_size')
row_fq = pd.DataFrame(row_fq,columns=['N_groups']).sort_index()
print(len(row_fq))
row_fq.head(10)
# cap to size of 12
#row_fq_cap = row_fq[:12]
#row_fq_cap

19

            N_groups
group_size
1                 24
2                 87
3                244
4                446
5                688
6                898
7                906
8                950
9                765
10               593

In [7]:
#plot distribution

# labels
labels = {'group_size' : "Group Size (# rows with the same combination)"
         ,'N_groups'   : "Frequency of Group Size"}

fig1 = px.bar(row_fq
              ,y='N_groups'
              ,labels=labels
              ,title="The frequency of groups of rows with the same value combination")
fig1.show()
fig1.write_image('./img/uniq_fq_dist.pdf')